# IncludeLastBar Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainerItem..::..IncludeLastBar Property
RebarContainerItem Class See Also
---
Identifies if the last bar in rebar set is shown.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IncludeLastBar { get; set; }
```

Visual Basic
---
```text
Public Property IncludeLastBar As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IncludeLastBar {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace